{
    "format": "layers-model",
    "generatedBy": "keras v2.0.8",
    "convertedBy": "TensorFlow.js Converter v2.1.0",
    "modelTopology": {
        "keras_version": "2.0.8",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Model",
            "config": {
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "dtype": "float32",
                            "batch_input_shape": [
                                null,
                                3,
                                192,
                                192
                            ],
                            "name": "input_1",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_1"
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "padding": [
                                [
                                    3,
                                    3
                                ],
                                [
                                    3,
                                    3
                                ]
                            ],
                            "trainable": true,
                            "name": "zero_padding2d_1",
                            "data_format": "channels_first"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding2d_1"
                    },
                    {
                        "class_name": "Conv",
                        "config": {
                            "padding": "valid",
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv_1",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_first",
                            "output_dim": 64,
                            "kernel_constraint": null,
                            "strides": [
                                2,
                                2
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": null,
                            "filters": 64,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": true,
                            "activity_regularizer": null,
                            "kernel_size": [
                                7,
                                7
                            ],
                            "size": 7
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "zero_padding2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv_1"
                    },
                    {
                        "class_name": "BatchNorm",
                        "config": {
                            "beta_constraint": null,
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "name": "batch_norm_1",
                            "epsilon": 1e-05,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "scale": true,
                            "axis": 1,
                            "gamma_constraint": null,
                            "gamma_regularizer": null,
                            "beta_regularizer": null,
                            "momentum": 0.1,
                            "center": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "batch_norm_1"
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "activation": "relu",
                            "trainable": true,
                            "name": "activation_1"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_norm_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "activation_1"
                    },
                    {
                        "class_name": "BatchNorm",
                        "config": {
                            "beta_constraint": null,
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "name": "batch_norm_2",
                            "epsilon": 1e-05,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "scale": true,
                            "axis": 1,
                            "gamma_constraint": null,
                            "gamma_regularizer": null,
                            "beta_regularizer": null,
                            "momentum": 0.1,
                            "center": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "activation_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "batch_norm_2"
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "activation": "relu",
                            "trainable": true,
                            "name": "activation_2"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_norm_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "activation_2"
                    },
                    {
                        "class_name": "Conv",
                        "config": {
                            "padding": "valid",
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv_2",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_first",
                            "output_dim": 64,
                            "kernel_constraint": null,
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": null,
                            "filters": 64,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": true,
                            "activity_regularizer": null,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "size": 1
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "activation_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv_2"
                    },
                    {
                        "class_name": "BatchNorm",
                        "config": {
                            "beta_constraint": null,
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "name": "batch_norm_3",
                            "epsilon": 1e-05,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "scale": true,
                            "axis": 1,
                            "gamma_constraint": null,
                            "gamma_regularizer": null,
                            "beta_regularizer": null,
                            "momentum": 0.1,
                            "center": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "batch_norm_3"
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "activation": "relu",
                            "trainable": true,
                            "name": "activation_3"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_norm_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "activation_3"
                    },
                    {
                        "class_name": "Conv",
                        "config": {
                            "padding": "valid",
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv_3",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_first",
                            "output_dim": 64,
                            "kernel_constraint": null,
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": null,
                            "filters": 64,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": true,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "size": 3
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "activation_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv_3"
                    },
                    {
                        "class_name": "BatchNorm",
                        "config": {
                            "beta_constraint": null,
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "name": "batch_norm_4",
                            "epsilon": 1e-05,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "scale": true,
                            "axis": 1,
                            "gamma_constraint": null,
                            "gamma_regularizer": null,
                            "beta_regularizer": null,
                            "momentum": 0.1,
                            "center": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "batch_norm_4"
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "activation": "relu",
                            "trainable": true,
                            "name": "activation_4"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_norm_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "activation_4"
                    },
                    {
                        "class_name": "Conv",
                        "config": {
                            "padding": "valid",
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv_4",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_first",
                            "output_dim": 128,
                            "kernel_constraint": null,
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": null,
                            "filters": 128,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": true,
                            "activity_regularizer": null,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "size": 1
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "activation_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv_4"
                    },
                    {
                        "class_name": "Conv",
                        "config": {
                            "padding": "valid",
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv_5",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_first",
                            "output_dim": 128,
                            "kernel_constraint": null,
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": null,
                            "filters": 128,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": true,
                            "activity_regularizer": null,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "size": 1
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "activation_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv_5"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "trainable": true,
                            "name": "add_1"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv_4",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "conv_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_1"
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_1",
                            "trainable": true,
                            "data_format": "channels_first",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "max_pooling2d_1"
                    },
                    {
                        "class_name": "BatchNorm",
                        "config": {
                            "beta_constraint": null,
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "name": "batch_norm_5",
                            "epsilon": 1e-05,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "scale": true,
                            "axis": 1,
                            "gamma_constraint": null,
                            "gamma_regularizer": null,
                            "beta_regularizer": null,
                            "momentum": 0.1,
                            "center": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "batch_norm_5"
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "activation": "relu",
                            "trainable": true,
                            "name": "activation_5"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_norm_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "activation_5"
                    },
                    {
                        "class_name": "Conv",
                        "config": {
                            "padding": "valid",
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv_6",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_first",
                            "output_dim": 64,
                            "kernel_constraint": null,
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": null,
                            "filters": 64,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": true,
                            "activity_regularizer": null,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "size": 1
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "activation_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv_6"
                    },
                    {
                        "class_name": "BatchNorm",
                        "config": {
                            "beta_constraint": null,
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "name": "batch_norm_6",
                            "epsilon": 1e-05,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "scale": true,
                            "axis": 1,
                            "gamma_constraint": null,
                            "gamma_regularizer": null,
                            "beta_regularizer": null,
                            "momentum": 0.1,
                            "center": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "batch_norm_6"
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "activation": "relu",
                            "trainable": true,
                            "name": "activation_6"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_norm_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "activation_6"
                    },
                    {
                        "class_name": "Conv",
                        "config": {
                            "padding": "valid",
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv_7",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_first",
                            "output_dim": 64,
                            "kernel_constraint": null,
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": null,
                            "filters": 64,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": true,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "size": 3
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "activation_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv_7"
                    },
                    {
                        "class_name": "BatchNorm",
                        "config": {
                            "beta_constraint": null,
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "name": "batch_norm_7",
                            "epsilon": 1e-05,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "scale": true,
                            "axis": 1,
                            "gamma_constraint": null,
                            "gamma_regularizer": null,
                            "beta_regularizer": null,
                            "momentum": 0.1,
                            "center": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "batch_norm_7"
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "activation": "relu",
                            "trainable": true,
                            "name": "activation_7"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_norm_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "activation_7"
                    },
                    {
                        "class_name": "Conv",
                        "config": {
                            "padding": "valid",
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv_8",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_first",
                            "output_dim": 128,
                            "kernel_constraint": null,
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": null,
                            "filters": 128,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": true,
                            "activity_regularizer": null,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "size": 1
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "activation_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv_8"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "trainable": true,
                            "name": "add_2"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv_8",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "max_pooling2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_2"
                    },
                    {
                        "class_name": "BatchNorm",
                        "config": {
                            "beta_constraint": null,
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "name": "batch_norm_8",
                            "epsilon": 1e-05,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "scale": true,
                            "axis": 1,
                            "gamma_constraint": null,
                            "gamma_regularizer": null,
                            "beta_regularizer": null,
                            "momentum": 0.1,
                            "center": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "batch_norm_8"
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "activation": "relu",
                            "trainable": true,
                            "name": "activation_8"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_norm_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "activation_8"
                    },
                    {
                        "class_name": "Conv",
                        "config": {
                            "padding": "valid",
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv_9",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_first",
                            "output_dim": 128,
                            "kernel_constraint": null,
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": null,
                            "filters": 128,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": true,
                            "activity_regularizer": null,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "size": 1
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "activation_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv_9"
                    },
                    {
                        "class_name": "BatchNorm",
                        "config": {
                            "beta_constraint": null,
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "name": "batch_norm_9",
                            "epsilon": 1e-05,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "scale": true,
                            "axis": 1,
                            "gamma_constraint": null,
                            "gamma_regularizer": null,
                            "beta_regularizer": null,
                            "momentum": 0.1,
                            "center": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv_9",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "batch_norm_9"
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "activation": "relu",
                            "trainable": true,
                            "name": "activation_9"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_norm_9",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "activation_9"
                    },
                    {
                        "class_name": "Conv",
                        "config": {
                            "padding": "valid",
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv_10",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_first",
                            "output_dim": 128,
                            "kernel_constraint": null,
                            "strides": [
                                1,
                                1
                            ],
